tuning_wdr/log/benchmark_log/1699256067.log
[2023-11-06 15:34:48,945:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.94 per sec.)
    queries:                             640    (38.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          16.4866s
    total number of events:              32

Latency (ms):
         min:                                12797.14
         avg:                                14557.46
         max:                                16483.96
         95th percentile:                    16519.10
         sum:                               465838.76

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   14.5575/1.34


[2023-11-06 15:36:05,041:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (2.65 per sec.)
    queries:                             640    (52.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          12.0837s
    total number of events:              32

Latency (ms):
         min:                                 5095.67
         avg:                                10113.33
         max:                                12080.11
         95th percentile:                    11946.04
         sum:                               323626.55

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   10.1133/1.96


[2023-11-06 15:36:21,033:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (2.87 per sec.)
    queries:                             660    (57.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          11.4792s
    total number of events:              33

Latency (ms):
         min:                                 3621.04
         avg:                                 9045.20
         max:                                11441.71
         95th percentile:                    11115.87
         sum:                               298491.58

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   9.3279/1.75