tuning_wdr/log/benchmark_log/1699271203.log
[2023-11-06 19:47:00,090:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (2.51 per sec.)
    queries:                             640    (50.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          12.7449s
    total number of events:              32

Latency (ms):
         min:                                 7471.58
         avg:                                10560.44
         max:                                12742.38
         95th percentile:                    12384.09
         sum:                               337934.14

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   10.5604/1.38


[2023-11-06 19:47:18,042:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            476
        write:                           136
        other:                           68
        total:                           680
    transactions:                        34     (2.46 per sec.)
    queries:                             680    (49.16 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          13.8277s
    total number of events:              34

Latency (ms):
         min:                                 4323.28
         avg:                                11002.79
         max:                                13716.13
         95th percentile:                    13550.80
         sum:                               374094.91

Threads fairness:
    events (avg/stddev):           1.0625/0.24
    execution time (avg/stddev):   11.6905/2.03